САБ/Documents/CW_РасходыПоГрузоперевозке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>CW_РасходыПоГрузоперевозке</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПорядокОтражения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

САБ/Enums/CW_ПорядокОтраженияЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>CW_ПорядокОтраженияЗатрат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Затраты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

САБ/Documents/CW_РасходыПоГрузоперевозке/Forms/ФормаДокументаУправляемая/Ext/Form/Module.bsl
&НаСервере
Процедура саб_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) И Объект.Услуги.Количество() > 0 Тогда
		Для Каждого Стр Из Объект.Услуги Цикл
			Если Не ЗначениеЗаполнено(Стр.ПорядокОтражения) Тогда
			 	Стр.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты;
				Стр.Количество = 1;
			 КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура саб_ПриОткрытииПосле(Отказ)
	//Если Не ЗначениеЗаполнено(Объект.Ссылка) И Объект.Услуги.Количество() > 0 Тогда		
	//	Для Каждого Стр Из Объект.Услуги Цикл
	//		Если Не ЗначениеЗаполнено(Стр.ПорядокОтражения) Тогда
	//			Стр.Количество = 1;
	//		 	Стр.ПорядокОтражения = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Затраты");
	//			ПриИзмененииУслугиПорядокОтражения();
	//		 КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;	
КонецПроцедуры
